# IsMember Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..IsMember Method
AssemblyInstance Class See Also
---
Determines whether the given ElementId is a member of this assembly
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsMember(
	ElementId id
)
```

Visual Basic
---
```text
Public Function IsMember ( _
	id As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsMember(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace